exports/physics/quantum_physics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-16 Mon 17:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Quantum mechanics</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Quantum mechanics</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2754257">1. Postulates</a></li>
<li><a href="#orgbb4ea72">2. Hamiltonian formalism</a>
<ul>
<li><a href="#orgc20f85e">2.1. EL equations</a>
<ul>
<li><a href="#orgdc29417">2.1.1. Cyclic coordinate</a></li>
<li><a href="#org2944fff">2.1.2. Energy conservation</a></li>
<li><a href="#orgdb3b7f8">2.1.3. Noether's theorem</a></li>
</ul>
</li>
<li><a href="#orgea82333">2.2. Hamiltonian</a>
<ul>
<li><a href="#org54fe986">2.2.1. Hamiltonian equations</a></li>
<li><a href="#orgf81220e">2.2.2. Cyclic coordinates</a></li>
<li><a href="#org56dbcea">2.2.3. Legendre transform</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org45b6a7a">3. Statevectors</a>
<ul>
<li><a href="#org0768435">3.1. Rotation Operators</a></li>
<li><a href="#org110e794">3.2. Matrix representation</a></li>
<li><a href="#orgf5ac232">3.3. Passive and active transform</a></li>
</ul>
</li>
<li><a href="#orga4025b4">4. Stern-Gerlach</a></li>
</ul>
</div>
</div>
<p>
this is in gaussian units
</p>

<div id="outline-container-org2754257" class="outline-2">
<h2 id="org2754257"><span class="section-number-2">1</span> Postulates</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Associated to any isolated physical system is a hilbert space which is completely described by its state vector.</li>
<li>The evolution of a closed quantum system is described by a unitary transformation. i.e. the shrodinger equation</li>
</ol>
</div>
</div>

<div id="outline-container-orgbb4ea72" class="outline-2">
<h2 id="orgbb4ea72"><span class="section-number-2">2</span> Hamiltonian formalism</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc20f85e" class="outline-3">
<h3 id="orgc20f85e"><span class="section-number-3">2.1</span> EL equations</h3>
<div class="outline-text-3" id="text-2-1">
<p>
L = T - V
</p>

<p>
\[
\dv{t}\left(\pdv{L}{\dot x}\right) = \pdv{L}{x}
\]
</p>

<ul class="org-ul">
<li>Generalised momentum</li>
</ul>

<p>
\[
\pdv{L}{\dot q} = p
\]
</p>

<ul class="org-ul">
<li>Generalised force</li>
</ul>

<p>
\[
\pdv{L}{q} = \dot{p}
\]
</p>
</div>


<div id="outline-container-orgdc29417" class="outline-4">
<h4 id="orgdc29417"><span class="section-number-4">2.1.1</span> Cyclic coordinate</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
When the Lagrangian does not depend on a coordinate qk:
</p>

<p>
\[
\pdv{L}{\dot q_k} = C
\]
</p>

<p>
This is also generalised momentum.
</p>

<p>
q<sub>k</sub> is thus a cyclic coordinate.
</p>
</div>
</div>

<div id="outline-container-org2944fff" class="outline-4">
<h4 id="org2944fff"><span class="section-number-4">2.1.2</span> Energy conservation</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
\[
\pdv{E}{t} = -\pdv{L}{t}
\]
</p>


<p>
\[
E = \left(\sum_{i=1}^N \pdv{L}{\dot q_i}\dot{q_i}\right) - L
\]
</p>

<p>
If L has no time dependence, then E is conserved.
</p>

<p>
E is indeed total energy when the new coordinate q is not related to the old coordinate x with a time dependence \(x = x(q,t)\) or qdot dependence \(x = x(q,\dot{q})\).
</p>
</div>
</div>

<div id="outline-container-orgdb3b7f8" class="outline-4">
<h4 id="orgdb3b7f8"><span class="section-number-4">2.1.3</span> Noether's theorem</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
For each symmetry of the Lagrangian, there is a conserved quantity.
</p>

<p>
Let the Lagrangian be invariant to first order in the small number \(\epsilon\).
</p>

<p>
\[
q_i \to q_i + \epsilon K_i(q)
\]
</p>

<p>
each K<sub>i</sub>(q) may be a function of all the q<sub>i</sub> and need not be constant.
</p>

<p>
The quantity:
</p>

<p>
\[
P(q,\dot{q}) = \sum_i \pdv{L}{\dot q_i}K_i(q)
\]
</p>

<p>
does not change with time and has the generic name of consered momentum.
</p>

<p>
Example:
</p>

<p>
For \(L = (m/2)(5\dot{x}^2 - 2\dot{x}\dot{y} + 2\dot{y}^2) + C(2x-y)\), K<sub>x</sub> = 1 and K<sub>y</sub> = 2:
</p>

<p>
\[
P = \pdv{L}{\dot{x}}K_x + \pdv{L}{\dot y}K_y = m(3\dot{x} + 3\dot{y})
\]
</p>
</div>
</div>
</div>

<div id="outline-container-orgea82333" class="outline-3">
<h3 id="orgea82333"><span class="section-number-3">2.2</span> Hamiltonian</h3>
<div class="outline-text-3" id="text-2-2">
<p>
We may write E as:
</p>

<p>
\[
E(q,\dot{q}) \equiv \pdv{L(q,\dot{q})}{\dot{q}}\dot{q} - L(q,\dot{q})
\]
</p>

<p>
and we wish to exchange all  \(\dot{q}\) for \(p\) in E.
</p>

<p>
\[
p \equiv \pdv{L}{\dot{q}}
\]
</p>

<p>
When written in this way, we define it as the Hamiltonian.
</p>

<p>
\[
H(q,p) \equiv p_i\dot{q_i}(q,p) - L(q,\dot{q}(q,p))
\]
</p>
</div>

<div id="outline-container-org54fe986" class="outline-4">
<h4 id="org54fe986"><span class="section-number-4">2.2.1</span> Hamiltonian equations</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
\[
\pdv{H}{p} = \dot{q}
\]
</p>

<p>
\[
\pdv{H}{q} = -\dot{p}
\]
</p>
</div>
</div>

<div id="outline-container-orgf81220e" class="outline-4">
<h4 id="orgf81220e"><span class="section-number-4">2.2.2</span> Cyclic coordinates</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Same as Lagrange.
if q is cyclic, p is conserved.
</p>


<p>
Let w(p,q) be some function of the state variables with no explicit dependence on t.
</p>

<p>
\[
\dot{\omega} = \{\omega,\mathcal{H}\}
\]
</p>

<p>
where the Poisson brackets (PB) between two variables is:
</p>

<p>
\[
\left\{\omega,\lambda\right\} = \sum_i \left(\pdv{\omega}{q_i}\pdv{\lambda}{p_i} - \pdv{\omega}{p_i}\pdv{\lambda}{q_i}\right)
\]
</p>
</div>

<ol class="org-ol">
<li><a id="org5a74b92"></a>Poisson bracket Identities<br />
<div class="outline-text-5" id="text-2-2-2-1">
<p>
Any variable whose PB with \(\mathcal{H}\) vanishes is constant in time.
</p>

<p>
{a,b} = -{b,a}
{a,b+c} = {a,b} + {a,c}
{a,bc} = {a,b}c + b{a,c}
</p>

<p>
(similar to commutators)
</p>

<p>
\[
$\{q_i,q_j\} = \{p_i,p_j\} = 0
\]
</p>

<p>
\[
\{q_i,p_j\}=\delta_{ij}
\]
</p>

<p>
as \(\partial{q_i}/\partial{q_j} = \delta_{ij}, \partial{q_i}/\partial{p_k}=0\)
</p>

<p>
Hamiltonian equations may be written as:
</p>

\begin{align*}
\dot{q_i} = \{q_i,\mathcal{H}\} \\
\dot{p_i} = \{p_i,\mathcal{H}\}
\end{align*}
</div>
</li>
</ol>
</div>


<div id="outline-container-org56dbcea" class="outline-4">
<h4 id="org56dbcea"><span class="section-number-4">2.2.3</span> Legendre transform</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Say that we wish to 'invert':
</p>

<p>
\[
\dv{F(x)}{x} = s(x)
\]
</p>

<p>
by constructing a function G(s) which is the Legendre transform of F(x):
</p>

<p>
\[
\dv{G(s)}{s} = x(s).
\]
</p>

<p>
By noting \(d(F+G) = s \dd{x} + x \dd{s} = d(sx)\), we may write:
</p>

<p>
\[
G = sx-F = F'x - F
\].
</p>

<p>
Or
</p>

<p>
\[
G(s) = sx(s) - F(x(s))
\]
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org45b6a7a" class="outline-2">
<h2 id="org45b6a7a"><span class="section-number-2">3</span> Statevectors</h2>
<div class="outline-text-2" id="text-3">
<p>
Statevector expressed in certain basis.
</p>

<p>
\[
\ket{\psi} = \ket{ + z}\braket{+ z}{\psi} + \ket{-z}\braket{-z}{\psi} = c_+\ket{+ z} + c_- \ket{-z}
\]
</p>

<p>
Expectation value: \(\langle\Omega\rangle\)
Square of uncertainty: \((\Delta \Omega)^2 = \langle\Omega^2\rangle - \langle\Omega\rangle^2\)
</p>

<p>
Two states that differ by an overall phase are the same state.
</p>
</div>


<div id="outline-container-org0768435" class="outline-3">
<h3 id="org0768435"><span class="section-number-3">3.1</span> Rotation Operators</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Rotate anticlockwise about z-axis can be defined as:
</p>

<p>
\[
\hat{R}(\dd{\phi} \bm{k}) = 1 - \frac{i}{\hbar}\hat{J_z}\dd{\phi}
\]
where \(\hat{J_z}\) is a hermitian operator and has |+- z&gt; as an eigenvector with +-hbar/2 as eigenvalues.
</p>

<p>
\[
\hat{R}(\phi \bm{k}) = \lim_{N\to\infty}\left[1-\frac{i}{\hbar}\hat{J}_z\left(\frac{\phi}{N}\right)\right]^N
= \exp(-i\hat{J}_z\phi/\hbar)
\]
</p>

<p>
\[
\hat{R}(\phi \bm{k})\ket{\pm z} = e^{\mp i \phi/2} \ket{\pm z}
\]
</p>


<p>
Notice that rotating by 360deg causes the state to pick up an overall minus sign.
</p>
</div>
</div>

<div id="outline-container-org110e794" class="outline-3">
<h3 id="org110e794"><span class="section-number-3">3.2</span> Matrix representation</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The matrix representation of \(\hat{A}\) in basis x is \(A_{ij} = \bra{i}\hat{A}\ket{j}\) where i j are the bases of x.
</p>
</div>
</div>

<div id="outline-container-orgf5ac232" class="outline-3">
<h3 id="orgf5ac232"><span class="section-number-3">3.3</span> Passive and active transform</h3>
<div class="outline-text-3" id="text-3-3">
<p>
passive: rotating the axes
active: rotating the vector expressed in the same axes.
</p>
</div>
</div>
</div>






<div id="outline-container-orga4025b4" class="outline-2">
<h2 id="orga4025b4"><span class="section-number-2">4</span> Stern-Gerlach</h2>
<div class="outline-text-2" id="text-4">
<p>
The intrinsic spin angular momentum of a particle, we write
</p>

<p>
\[
\bm{\mu} = \frac{gq}{2mc}\bm{S}
\]
</p>

<p>
The force by the magnet equals:
</p>

<p>
\[
F_z = \mu_B \pdv{B}{z}
\]
</p>

<p>
where u<sub>b</sub> is the bohr magneton
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-08-16 Mon 17:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
